; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v3 - type_3 ?v5 - type_2)
 	      (pred_4 ?v8 - object ?v5 - type_2)
	      (pred_3 ?v3 - type_3 ?v4 - type_1)
	      (pred_1 ?v3 - type_3 ?v8 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v3 - type_3 ?v1 ?v2 - type_2)
       :precondition (and  (pred_2 ?v3 ?v1))
       :effect (and  (pred_2 ?v3 ?v2)
		     (not (pred_2 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_3 ?v6 - object ?v7 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_2 ?v3 ?v7) (pred_3 ?v3 ?v4))
       :effect (and (pred_1 ?v3 ?v6 ?v4)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_3 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_3 ?v6 - object ?v7 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v6 ?v4) (pred_2 ?v3 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_3 ?v3 ?v4)
		    (not (pred_1 ?v3 ?v6 ?v4)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_07 obj_02 - type_1
obj_03 obj_09 obj_06 - type_2
obj_04 obj_08 obj_05 - object)
(:init
(pred_2 obj_01 obj_06)
(pred_3 obj_01 obj_07)
(pred_3 obj_01 obj_02)
(pred_4 obj_04 obj_06)
(pred_4 obj_08 obj_09)
(pred_4 obj_05 obj_09)
)
(:goal
(and
(pred_4 obj_04 obj_09)
(pred_4 obj_08 obj_03)
(pred_4 obj_05 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_01 ?b obj_02))))
)
)

; plan
1. (op_1 obj_01 obj_04 obj_06 obj_07)
   deleted: (pred_4 obj_04 obj_06) (pred_3 obj_01 obj_07)
   added: (pred_1 obj_01 obj_04 obj_07)
   goals met: 0 of 3
2. (op_2 obj_01 obj_06 obj_09)
   deleted: (pred_2 obj_01 obj_06)
   added: (pred_2 obj_01 obj_09)
   goals met: 0 of 3
3. (op_3 obj_01 obj_04 obj_09 obj_07)
   deleted: (pred_1 obj_01 obj_04 obj_07)
   added: (pred_4 obj_04 obj_09) (pred_3 obj_01 obj_07)
   goals met: 1 of 3
4. (op_1 obj_01 obj_08 obj_09 obj_07)
   deleted: (pred_4 obj_08 obj_09) (pred_3 obj_01 obj_07)
   added: (pred_1 obj_01 obj_08 obj_07)
   goals met: 1 of 3
5. (op_2 obj_01 obj_09 obj_03)
   deleted: (pred_2 obj_01 obj_09)
   added: (pred_2 obj_01 obj_03)
   goals met: 1 of 3
6. (op_3 obj_01 obj_08 obj_03 obj_07)
   deleted: (pred_1 obj_01 obj_08 obj_07)
   added: (pred_4 obj_08 obj_03) (pred_3 obj_01 obj_07)
   goals met: 2 of 3
7. (op_2 obj_01 obj_03 obj_09)
   deleted: (pred_2 obj_01 obj_03)
   added: (pred_2 obj_01 obj_09)
   goals met: 2 of 3
8. (op_1 obj_01 obj_05 obj_09 obj_07)
   deleted: (pred_4 obj_05 obj_09) (pred_3 obj_01 obj_07)
   added: (pred_1 obj_01 obj_05 obj_07)
   goals met: 2 of 3
9. (op_2 obj_01 obj_09 obj_03)
   deleted: (pred_2 obj_01 obj_09)
   added: (pred_2 obj_01 obj_03)
   goals met: 2 of 3
10. (op_3 obj_01 obj_05 obj_03 obj_07)
   deleted: (pred_1 obj_01 obj_05 obj_07)
   added: (pred_4 obj_05 obj_03) (pred_3 obj_01 obj_07)
   goals met: 3 of 3
